In [5]:
import pandas as pd

In [12]:
df1 = pd.DataFrame({'EmployeeID': [1, 2, 3, 4],'Name': ['Alice', 'Bob', 'Charlie', 'David'],'Department': ['HR', 'IT', 'Finance', 'Marketing']})

In [13]:
print(df1)

   EmployeeID     Name Department
0           1    Alice         HR
1           2      Bob         IT
2           3  Charlie    Finance
3           4    David  Marketing

In [16]:
df2 = pd.DataFrame({'EmployeeID': [3, 4, 5, 6],'Salary': [70000, 80000, 75000, 65000],'Location': ['New York', 'San Francisco', 'Chicago', 'Boston']})

In [17]:
inner_join = pd.merge(df1, df2, on='EmployeeID', how='inner')
print("\nInner Join Result:")
display(inner_join)

Inner Join Result:

   EmployeeID     Name Department  Salary       Location
0           3  Charlie    Finance   70000       New York
1           4    David  Marketing   80000  San Francisco

In [18]:
# Left Join: all records from df1, matched records from df2
left_join = pd.merge(df1, df2, on='EmployeeID', how='left')
print("\nLeft Join Result:")
display(left_join)

Left Join Result:

   EmployeeID     Name Department   Salary       Location
0           1    Alice         HR      NaN            NaN
1           2      Bob         IT      NaN            NaN
2           3  Charlie    Finance  70000.0       New York
3           4    David  Marketing  80000.0  San Francisco

In [19]:
# Right Join: all records from df2, matched records from df1
right_join = pd.merge(df1, df2, on='EmployeeID', how='right')
print("\nRight Join Result:")
display(right_join)

Right Join Result:

   EmployeeID     Name Department  Salary       Location
0           3  Charlie    Finance   70000       New York
1           4    David  Marketing   80000  San Francisco
2           5      NaN        NaN   75000        Chicago
3           6      NaN        NaN   65000         Boston

In [20]:
# Outer Join: all records from both df1 and df2
outer_join = pd.merge(df1, df2, on='EmployeeID', how='outer')
print("\nOuter Join Result:")
display(outer_join)

Outer Join Result:

   EmployeeID     Name Department   Salary       Location
0           1    Alice         HR      NaN            NaN
1           2      Bob         IT      NaN            NaN
2           3  Charlie    Finance  70000.0       New York
3           4    David  Marketing  80000.0  San Francisco
4           5      NaN        NaN  75000.0        Chicago
5           6      NaN        NaN  65000.0         Boston